# نقوم بعمل متغيرات فيها انواع بيانات مختلفة للتجربة

# قائمة
list = [4, 8, 7, "Ahmed", True]
# مترابطة
tuple = (4, 8, 7, "Ahmed", True)
# نص 
string = "Hello World!"

# الان سوف نقوم بطباعة طول كل متغير

# الدالة ستقوم بحسابة عدد عناصر القائمة
print("طول القائمة هو ", len(list), " عناصر")
# الدالة ستقوم بحسابة عدد عناصر المترابطة
print("طول المترابطة هو ", len(tuple), " عناصر")
# في حالة النصوص، الدالة سوف تقوم بحسابة عدد حروف النص
print("طول النص هو ", len(string), " عنصر")

# المخرجات
#>> طول القائمة هو 5 عناصر
#>> طول المترابطة هو 5 عناصر
#>> طول النص هو 12 عنصر
# سنلاحظ ان الدالة قامت بحسابة طول النص ك 12 عنصر بدلا من 11 لان عدد حروف الجملة هو 11، لكن الدالة تقوم بحسابة المسافات ايضا
