# نقوم ب اخذ رقم من المستخدم 
number = int(input("قم بكتابة رقم "))

# تقوم بعمل قائمة فيها عدة ارقام عشوائية و فيها الرقم الخاص ب المستخدم
numbers = [73, 13, 9, 22, number]

# الان نقوم بعمل شرط يتاكد من ان كان اصغر رقم يساوي الرقم اللذي كتبه المستخدم

if min(numbers) == number:
# سنقوم بطباعة ان المستخدم قام بكتابة اقل رقم في القائمة
    print("لقد قمت باختيار اصغر رقم في القائمة")

# نقوم بعمل شرط else، ان كان المستخدم لم يقم بكتابة اصغر قيمة في القائمة
else:
    print("رقمك ليس الاصغر في القائمة")

# المخرجات
#>> قم بكتابة رقم
# سوف نقوم بكتابة 10 في اول مرة 
#>> رقمك ليس الاصغر في القائمة
# الان سوف نجرب بكتابة 5 في تاني مرة
#>> لقد قمت ب اختيار اصغر رقم في القائمة
