# نقوم باخد عمر المستخدم 
age = int(input("قم بكتابة عمرك: "))
# نقوم بالتاكد انه اكبر من 18 سنة و سيقوم بطباعة ان الدخول مسموح
if age > 18:
    print("تستطيع استخدام الخدمة")

# ان لم يكن اكبر من 18، نتاكد من ان عمره يساوي 18 لتذكيره ب التسجيل السنه القادمة

elif age == 18:
    print("يجب ان تكون اكبر من 18 سنة!، حاول السنة القادمة")

# اذا كان المستخدم ليس اكبر من 18 ولا يساوي 18، نقوم بطباعة انه صغير علي استخدام الخدمة
else:
    print("لا تستطيع استخدام الخدمة")

# المخرجات
#>> قم بكتابة عمرك
# سوف نقوم بكتابة 19 للتجربة
#>> تستطيع استخدام الخدمة

# سوف نقوم بكتابة 17 هذه المرة
#>> لا تستطيع استخدام الخدمة

# اخيرا سوف نجرب كتابة 18
#>> يجب ان تكون اكبر من 18 سنة!، حاول السنة القادمة
