# نقوم بتعين الاسم و عدد مرات الطباعة
name = "احمد"
number = 4

# سنقوم بتعيين متغير و نخزن فيه كم مرة قام فيها البرنامج ب الطباعة

printed = 0

# سنقوم بعمل حلقة while و شرطها ان تتأكد في كل مرة ان عدد المرات اللتي تم طباعتها اقل من العدد الذي نريده، و اذا تحقق الشرط نطبع الاسم،. ونقوم بزيادة عدد المرات اللتي تم طباعتها ب 1

while printed < number:
    print("اسمك هو ", name)
    printed = printed + 1

# سنقوم في النهاية ب طباعة ان الحلقة قد انتهت
print("تم الانتهاء")

# المخرجات:
#>> اسمك هو احمد
#>> اسمك هو احمد
#>> اسمك هو احمد
#>> اسمك هو احمد
#>> تم الانتهاء
